### Joins in pandas
#### types of joins: inner, outer, left, right

In [17]:
import pandas as pd
import numpy as np

In [18]:
df1 = pd.DataFrame({
    "name" : ['sunil', 'anil', 'ram', 'shyam', 'sita', 'gita'],
    "age" : [20,21,24,26,45,34],
    "city" : ['ktm', 'pkr', 'htd', 'bkt', 'brt', 'palpa'],
    "id" : [1,2,3,4,5,6]
})
df1

    name  age   city  id
0  sunil   20    ktm   1
1   anil   21    pkr   2
2    ram   24    htd   3
3  shyam   26    bkt   4
4   sita   45    brt   5
5   gita   34  palpa   6

In [19]:
df2 = pd.DataFrame({
    "fruits_name": ['apple', 'mango', 'banana', 'mango', 'grapes', 'kiwi', 'litchi', 'papaya', 'berry'], 
    "id" : [1,2,3,7,8,9,10,11, 12]
})
df2

  fruits_name  id
0       apple   1
1       mango   2
2      banana   3
3       mango   7
4      grapes   8
5        kiwi   9
6      litchi  10
7      papaya  11
8       berry  12

### Inner join

In [20]:
pd.merge(df1, df2, how='inner', on='id')

    name  age city  id fruits_name
0  sunil   20  ktm   1       apple
1   anil   21  pkr   2       mango
2    ram   24  htd   3      banana

### Left join

In [21]:
pd.merge(df1, df2, how="left", on="id")

    name  age   city  id fruits_name
0  sunil   20    ktm   1       apple
1   anil   21    pkr   2       mango
2    ram   24    htd   3      banana
3  shyam   26    bkt   4         NaN
4   sita   45    brt   5         NaN
5   gita   34  palpa   6         NaN

In [22]:
pd.merge(df1, df2, how="right", on="id")

    name   age city  id fruits_name
0  sunil  20.0  ktm   1       apple
1   anil  21.0  pkr   2       mango
2    ram  24.0  htd   3      banana
3    NaN   NaN  NaN   7       mango
4    NaN   NaN  NaN   8      grapes
5    NaN   NaN  NaN   9        kiwi
6    NaN   NaN  NaN  10      litchi
7    NaN   NaN  NaN  11      papaya
8    NaN   NaN  NaN  12       berry

In [23]:
pd.merge(df1, df2, how="outer", on="id")

     name   age   city  id fruits_name
0   sunil  20.0    ktm   1       apple
1    anil  21.0    pkr   2       mango
2     ram  24.0    htd   3      banana
3   shyam  26.0    bkt   4         NaN
4    sita  45.0    brt   5         NaN
5    gita  34.0  palpa   6         NaN
6     NaN   NaN    NaN   7       mango
7     NaN   NaN    NaN   8      grapes
8     NaN   NaN    NaN   9        kiwi
9     NaN   NaN    NaN  10      litchi
10    NaN   NaN    NaN  11      papaya
11    NaN   NaN    NaN  12       berry

### Concatenation in Pandas

In [25]:
data1 = pd.DataFrame(np.arange(1, 13).reshape(4,3), columns=['col1', 'col2', 'col3'])
data1

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12

In [28]:
data2 = pd.DataFrame(np.arange(1, 25).reshape(6,4), columns=['col1', 'col2', 'col3','col4'])
data2

   col1  col2  col3  col4
0     1     2     3     4
1     5     6     7     8
2     9    10    11    12
3    13    14    15    16
4    17    18    19    20
5    21    22    23    24

In [29]:
pd.concat([data1, data2], axis=1)

   col1  col2  col3  col1  col2  col3  col4
0   1.0   2.0   3.0     1     2     3     4
1   4.0   5.0   6.0     5     6     7     8
2   7.0   8.0   9.0     9    10    11    12
3  10.0  11.0  12.0    13    14    15    16
4   NaN   NaN   NaN    17    18    19    20
5   NaN   NaN   NaN    21    22    23    24

In [30]:
pd.concat([data1, data2], axis=0)

   col1  col2  col3  col4
0     1     2     3   NaN
1     4     5     6   NaN
2     7     8     9   NaN
3    10    11    12   NaN
0     1     2     3   4.0
1     5     6     7   8.0
2     9    10    11  12.0
3    13    14    15  16.0
4    17    18    19  20.0
5    21    22    23  24.0